const provinces = [
    { value: '4', label: 'آذربايجان شرقي' },
    { value: '5', label: 'آذربايجان غربي' },
    { value: '25', label: 'اردبيل' },
    { value: '11', label: 'اصفهان' },
    { value: '31', label: 'البرز' },
    { value: '17', label: 'ايلام' },
    { value: '19', label: 'بوشهر' },
    { value: '24', label: 'تهران' },
    { value: '30', label: 'خراسان جنوبي' },
    { value: '10', label: 'خراسان رضوئ' },
    { value: '29', label: 'خراسان شمالي' },
    { value: '7', label: 'خوزستان' },
    { value: '20', label: 'زنجان' },
    { value: '21', label: 'سمنان' },
    { value: '12', label: 'سيستان وبلوچستان' },
    { value: '8', label: 'فارس' },
    { value: '27', label: 'قزوين' },
    { value: '26', label: 'قم' },
    { value: '13', label: 'كردستان' },
    { value: '9', label: 'كرمان' },
    { value: '6', label: 'کرمانشاه' },
    { value: '18', label: 'كهگيلويه وبويراحمد' },
    { value: '28', label: 'گلستان' },
    { value: '2', label: 'گيلان' },
    { value: '16', label: 'لرستان' },
    { value: '3', label: 'مازندران' },
    { value: '1', label: 'مرکزی' },
    { value: '23', label: 'هرمزگان' },
    { value: '14', label: 'همدان' },
    { value: '15', label: 'چهارمحال وبختياری' },
    { value: '22', label: 'یزد' },
]

const cities = [
    { value: '0', label: ' گلوگاه' },
    { value: '1', label: ' بهشهر' },
    { value: '2', label: ' نکا' },
    { value: '3', label: ' میان‌دورود' },
    { value: '4', label: ' ساری' },
    { value: '5', label: ' جویبار' },
    { value: '6', label: ' سیمرغ' },
    { value: '7', label: ' قائم‌شهر' },
    { value: '8', label: ' سوادکوه شمالی' },
    { value: '9', label: ' سوادکوه' },
    { value: '10', label: ' بابلسر' },
    { value: '11', label: ' بابل' },
    { value: '12', label: ' فریدون‌کنار' },
    { value: '13', label: ' محمودآباد' },
    { value: '14', label: ' آمل' },
    { value: '15', label: 'نور' },
    { value: '16', label: 'نوشهر' },
    { value: '17', label: 'چالوس' },
    { value: '18', label: 'کلاردشت' },
    { value: '19', label: 'عباس‌آباد' },
    { value: '20', label: 'تنکابن' },
    { value: '21', label: 'رامسر' },
]

const citiesMazandaran = [
    { value: '0', label: ' گلوگاه' },
    { value: '1', label: ' بهشهر' },
    { value: '2', label: ' نکا' },
    { value: '3', label: ' میان‌دورود' },
    { value: '4', label: ' ساری' },
    { value: '5', label: ' جویبار' },
    { value: '6', label: ' سیمرغ' },
    { value: '7', label: ' قائم‌شهر' },
    { value: '8', label: ' سوادکوه شمالی' },
    { value: '9', label: ' سوادکوه' },
    { value: '10', label: ' بابلسر' },
    { value: '11', label: ' بابل' },
    { value: '12', label: ' فریدون‌کنار' },
    { value: '13', label: ' محمودآباد' },
    { value: '14', label: ' آمل' },
    { value: '15', label: 'نور' },
    { value: '16', label: 'نوشهر' },
    { value: '17', label: 'چالوس' },
    { value: '18', label: 'کلاردشت' },
    { value: '19', label: 'عباس‌آباد' },
    { value: '20', label: 'تنکابن' },
    { value: '21', label: 'رامسر' },
]
// نوع حادثه
const filter_f1 = ['زلزله', 'سیل', 'رانش']
// نوع خسارت
const filter_f2 = ['احداثی', 'تعمیری']
// سطح خسارت
const filter_f3 = ['احداثی نوع 1 ', 'احداثی نوع 2 ', 'تعمیری نوع 1', 'تعمیری نوع 2']
// موقعیت
const filter_f4 = ['شهری', 'روستایی']
// استان
const filter_f6 = ['تهران', 'مازندران', 'کرمانشاه']
// نوع تسهیلات
const filter_f7 = ['احداثی', 'تعمیری'] //
// پیشرفت فیزیکی
const filter_f8 = ['آوار برداری', 'پی کنی', 'اجرای اسکلت']
// نهاد حمایتی
const filter_f9 = ['هیچ کدام', 'کمیته امداد', 'بهزیستی']
// نوع کاربری
const filter_f11 = ['مسکونی', 'تجاری', 'اداری']
// سطح خسارت X
const filter_f12 = ['سالم', 'نوع 1 ', 'نوع 2']
// وضعیت تصویه حساب
const filter_f13 = ['تسویه شده', 'تسویه نشده']
// وضعیت پایان کار
const filter_f14 = ['همه', ' دارای پایان کار', 'بدون پایان کار']
// وضعیت X
const filter_f15 = ['تایید شده', 'تایید نشده', 'بررسی اولیه', 'راکد']
// حادثه
const filter_f16 = [
    'زلزله کاشان 96',
    'سیل گلستان 98',
    'زلزله آبان 98 آذربایجان شرقی تکمیلی',
    'زلزله اردیبهشت 1400 ایلام',
    'لزله اردیبهشت 1392 هرمزگان ',
    'زلزله ۹۸ خراسان رضوی',
    'زلزله ٩٩ گلستان',
    'زلزله 99 هرمزگان',
    'زلزله 99 گیلان',
    'زلزله 99 کهگیلویه و بویراحمد',
    'زلزله 99 فارس ',
    'زلزله 99 چهارمحال و بختیاری',
    'زلزله 97 خراسان شمالی - جاجرم',
    'زلزله 96 ایلام',
    'رانش فروردین ۹۸ سمنان',
    'رانش خرداد 1400 گیلان',
    'رانش 98 گیلان',
    'برف بهمن 1401 چهارمحال و بختیاری',
    'برف بهمن 1401 اصفهان',
    'بارندگی های شدید، طوفان و سیل97 گلستان',
    'بارندگی و آبگرفتگی آذر ماه 99 خوزستان',
    'بارندگی و آب گرفتگی آذرماه98 خوزستان',
    'آبگرفتگی مرداد 1400 مازندران',
]
// ستاد
const filter_f17 = ['ستاد گرگان', 'ستاد رامیان'] //
// نوع تصرف
const filter_f18 = ['مالک', 'مستاجر', 'مالک دوم', 'مستاجر دارای زمین', 'خانوار فرعی']
// نوع حواله
const filter_f19 = ['رایگان', 'نقدی', 'اعتباری', 'چک']
// وضعیت حواله
const filter_f20 = ['در جریان', 'تحویل حواله', 'باطل شده'] //
// نوع تحویل حواله
const filter_f21 = ['عادی', 'خروج مستقیم']
// حوالات X
const filter_f22 = ['آجر', 'اسکلت 85 متری', 'میلگرد 14']
// وضعیت کانکس
const filter_f23 = ['دارد', 'ندارد']
// وضعیت تسهیلات
const filter_f24 = ['انعقاد قرارداد', 'لغو قرارداد', 'معرفی', 'لغو معرفی'] //
// بانک عامل
const filter_f25 = ['ملی', 'ملت', 'صادرات']
//شهرستان
const filter_f30 = ['کرمانشاه', 'سرپل ذهاب', 'قصر شیرین', 'دالاهو']
// سال وقوع حادثه
const filter_f31 = ['1402', '1401', '1400']
// سال اعتبار تسهیلات
const filter_f32 = ['1402', '1401', '1400']
// نوع سازه
const filter_f33 = ['اسکلت بتنی', 'اسکلت فولادی', 'سازه بنایی']
//نوع پروژه
const filter_f39 = ['جدید', 'اضافه بنا']
// وضعیت تسهیلات پروژه
const filter_f40 = ['وامی', 'غیر وامی', 'وامی و غیر وامی']
// نوع مالکیت
const filter_f42 = ['سند شش دانگ', 'قولنامه', 'قرارداد واگذاری'] //
// نوع مهندسین
const filter_f43 = ['کاردان', 'کارشناس']
// نوع صلاحیت
const filter_f44 = ['ناظر ', 'طراح', 'مجری']
// پایه صلاحیت
const filter_f45 = ['کاراموزی', 'پایه 3', 'پایه 2', 'پایه 1', 'ارشد']
// زمینه فعالیت
const filter_f46 = ['عمران', 'معماری', 'مکانیک', 'برق']
// سال سهمیه نظارت
const filter_f47 = ['1402', '1401', '1400', '1399']
// مدرک تحصیلی
const filter_f48 = ['فوق دیپلم', 'لیسانس', 'فوق لیسانس', 'دکتری']
// رشته تحصیلی
const filter_f49 = ['معماری', 'عمران ', 'برق', 'مکانیک', 'نقشه برداری', 'راهسازی']
// وضعیت مهندسی
const filter_f50 = ['فعال', 'غیر فعال', 'حذف موقت', 'غیر فعال توسط استان', 'غیر فعال توسط مرکز']
// نوع عضویت
const filter_f51 = ['نظام مهندسی', 'نظام کاردانی', 'نظام فنی روستایی'] //

export {
    provinces,
    cities,
    citiesMazandaran,
    filter_f1,
    filter_f11,
    filter_f12,
    filter_f13,
    filter_f14,
    filter_f15,
    filter_f16,
    filter_f17,
    filter_f18,
    filter_f19,
    filter_f2,
    filter_f20,
    filter_f21,
    filter_f22,
    filter_f23,
    filter_f24,
    filter_f25,
    filter_f3,
    filter_f30,
    filter_f31,
    filter_f32,
    filter_f33,
    filter_f39,
    filter_f4,
    filter_f40,
    filter_f42,
    filter_f43,
    filter_f44,
    filter_f45,
    filter_f46,
    filter_f47,
    filter_f48,
    filter_f49,
    filter_f50,
    filter_f51,
    filter_f6,
    filter_f7,
    filter_f8,
    filter_f9,
}
